%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%第一问
%绘制控制顶点
grid on
x1=[0 1 2 3];
y1=[0,-1,2,-1];
z1=[1,0,1,0];
plot3(x1,y1,z1,'o')
hold on
%绘制控制多边形
plot3(x1,y1,z1,'r')
hold on
plot3([0,2],[0,2],[1,1], 'Color', [0, 0, 0.5])
hold on
plot3([1,3],[-1,-1],[0,0], 'Color', [0, 0, 0.5])
hold on
%绘制bizer曲线
t=0:0.01:1;
x=3.*t.*(1-t).^2+6*t.^2.*(1-t)+3*t.^3;
y=-3*t.*(1-t).^2+6*t.^2.*(1-t)-t.^3;
z=(1-t).^3+3*t.^2.*(1-t);
plot3(x,y,z)
str={'P_{0} ','P_{1} ','P_{2} ','P_{3} '}
for i=1:4
    text(x1(i),y1(i),z1(i),str{i},'Margin', 1, 'FontSize', 12)
end
legend('控制顶点','控制点连线','控制多边形','bizer曲线')
figure(2)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%第二问
x=@(u,v)2*u*(1-u)*(1-v)^2+2*u^2*(1-v)^2+2*u*(1-u)*2*v*(1-v)+2*u^2*2*v*(1-v)+2*u*(1-u)*v^2+2*u^2*v^2;
y=@(u,v)(1-u)^2*2*v*(1-v)+2*u*(1-u)*2*v*(1-v)+u^2*2*v*(1-v)+2*(1-u)^2*v^2+2*2*u*(1-u)*v^2+2*u^2*v^2;
z=@(u,v)(1-u)^2*(1-v)^2+2*2*u*(1-u)*(1-v)^2+u^2*(1-v)^2+2*(1-u)^2*2*v*(1-v)+2*u*(1-u)*2*v*(1-v)+2*u^2*2*v*(1-v)+1*(1-u)^2*v^2+2*2*u*(1-u)*v^2+1*u^2*v^2;
ezmesh(x,y,z, [0 1 0 1])
alpha(0.4)
shading interp % 美化1
hold on
%绘制控制网格
x1=[0,1,2;0,1,2;0,1,2];y1=[0,0,0;1,1,1;2,2,2];z1=[1,2,1;2,1,2;1,2,1];
plot3(x1(1,:),y1(1,:),z1(1,:),'r','LineWidth', 1.7)
plot3(x1(2,:),y1(2,:),z1(2,:),'r','LineWidth', 1.7)
plot3(x1(3,:),y1(3,:),z1(3,:),'r','LineWidth', 1.7)
x1=x1';y1=y1';z1=z1';
plot3(x1(1,:),y1(1,:),z1(1,:),'r','LineWidth', 1.7)
plot3(x1(2,:),y1(2,:),z1(2,:),'r','LineWidth', 1.7)
plot3(x1(3,:),y1(3,:),z1(3,:),'r','LineWidth', 1.7)
%绘制控制顶点
x1=[x1(1,:),x1(2,:),x1(3,:)];y1=[y1(1,:),y1(2,:),y1(3,:)];z1=[z1(1,:),z1(2,:),z1(3,:)];
plot3(x1,y1,z1,'o', 'MarkerSize', 5,'LineWidth', 1.7)
%给控制顶点添加文字说明
set(gca, 'TickLabelInterpreter', 'latex');
set(gca, 'fontsize', 10); 
str={'P_{0,0} ','P_{1,0} ','P_{2,0} ','P_{0,1} ','P_{1,1} ','P_{2,1} ','P_{0,2} ','P_{1,2} ','P_{2,2} '};
for i=1:9
    text(x1(i),y1(i),z1(i),str{i},'Margin', 1, 'FontSize', 12)
end